Revit 2027 API
CanExecuteEventArgs Methods
The CanExecuteEventArgs type exposes the following members.
Methods
Name | Description
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetSelectedCategoryIds | Gets the category ids of selected elements.
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
CanExecuteEventArgs Class
Autodesk.Revit.UI.Events Namespace